Revit 2027 API
CurveOverlapPoint Properties
The CurveOverlapPoint type exposes the following members.
Properties
Name | Description
FirstParameter |  The point's unnormalized parameter on the first curve.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Point |  The 3D coordinate of the point.
SecondParameter |  The point's unnormalized parameter on the second curve.
Type |  The type of overlap at the point.
Top
See Also
Reference
CurveOverlapPoint Class
Autodesk.Revit.DB Namespace